## Terraform Production Environment Planner
### :art: Terraform Format and Style 
Code formatted with status of `success` .

### :tada: Terraform Initialization
Terraform initialized with status of `success` .

### :white_check_mark: Terraform Validation
The terraform code has been validated with the status of `success` .
For more information on the validation output, please expand the details below.
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### :memo: Terraform Plan
The terraform plan has been generated with the status of `success` .
For more information on the plan output, please expand the details below.
<details><summary>Show Plan</summary>

```

terraform
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Reading...
module.lambda_stack.aws_ecr_repository.this: Refreshing state... [id=lambda_api_local_container_repository]
module.lambda_stack.aws_api_gateway_rest_api.this: Refreshing state... [id=8b6011d7s9]
module.lambda_stack.data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]
module.lambda_stack.aws_iam_role.this: Refreshing state... [id=lambda_api_local_lambda_function_role]
module.lambda_stack.aws_api_gateway_resource.this: Refreshing state... [id=xscyty]
module.lambda_stack.aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-8b6011d7s9-st0y2qfpbk-ANY]
module.lambda_stack.aws_api_gateway_method.proxy: Refreshing state... [id=agm-8b6011d7s9-xscyty-ANY]
module.lambda_stack.null_resource.ecr_image: Refreshing state... [id=4398742042279864643]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_stack.aws_api_gateway_method.proxy has been deleted
  - resource "aws_api_gateway_method" "proxy" {
      - http_method          = "ANY" -> null
        id                   = "agm-8b6011d7s9-xscyty-ANY"
      - resource_id          = "xscyty" -> null
        # (6 unchanged attributes hidden)
    }

  # module.lambda_stack.aws_api_gateway_method.proxy_root has been deleted
  - resource "aws_api_gateway_method" "proxy_root" {
      - http_method          = "ANY" -> null
        id                   = "agm-8b6011d7s9-st0y2qfpbk-ANY"
      - resource_id          = "st0y2qfpbk" -> null
        # (6 unchanged attributes hidden)
    }

  # module.lambda_stack.aws_api_gateway_resource.this has been deleted
  - resource "aws_api_gateway_resource" "this" {
      - id          = "xscyty" -> null
        # (4 unchanged attributes hidden)
    }

  # module.lambda_stack.aws_api_gateway_rest_api.this has been deleted
  - resource "aws_api_gateway_rest_api" "this" {
      - execution_arn                = "arn:aws:execute-api:us-east-1:027075156904:8b6011d7s9" -> null
      - id                           = "8b6011d7s9" -> null
        name                         = "lambda_api_local_api_gateway"
      - root_resource_id             = "st0y2qfpbk" -> null
        tags                         = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_stack.aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
    }

  # module.lambda_stack.aws_api_gateway_integration.lambda will be created
  + resource "aws_api_gateway_integration" "lambda" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_integration.lambda_root will be created
  + resource "aws_api_gateway_integration" "lambda_root" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_method.proxy_root will be created
  + resource "aws_api_gateway_method" "proxy_root" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "ANY"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_resource.this will be created
  + resource "aws_api_gateway_resource" "this" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # module.lambda_stack.aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for lambda_api API project in prod environment"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "lambda_api_prod_api_gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.lambda_stack.aws_ecr_repository.this must be replaced
-/+ resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:us-east-1:027075156904:repository/lambda_api_local_container_repository" -> (known after apply)
      + force_delete         = true
      ~ id                   = "lambda_api_local_container_repository" -> (known after apply)
      ~ name                 = "lambda_api_local_container_repository" -> "lambda_api_prod_container_repository" # forces replacement
      ~ registry_id          = "027075156904" -> (known after apply)
      ~ repository_url       = "027075156904.dkr.ecr.us-east-1.amazonaws.com/lambda_api_local_container_repository" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.lambda_stack.aws_iam_role.this must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::027075156904:role/lambda_api_local_lambda_function_role" -> (known after apply)
      ~ create_date           = "2023-11-18T17:56:37Z" -> (known after apply)
      ~ id                    = "lambda_api_local_lambda_function_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "lambda_api_local_lambda_function_role" -> "lambda_api_prod_lambda_function_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQMTOODOUCOYY6PAVM" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_stack.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function for lambda_api project in prod environment"
      + function_name                  = "lambda_api_prod_lambda_function"
      + id                             = (known after apply)
      + image_uri                      = "027075156904.dkr.ecr.us-east-1.amazonaws.com/lambda_api_prod_container_repository:e25cc9dd228fef37e4f08c9bc38a308dd6410e69"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_STAGE" = "prod"
            }
        }
    }

  # module.lambda_stack.aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda_api_prod_lambda_function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

Plan: 11 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + base_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @damarals, Action: `pull_request`, Workflow: `Create terraform plan of the API infrastructure`*